Repository: ikn/gcedit
Catalog: i18n/po/*.po
Languages: pt_pt, ru

source: B
ru: Б

source: KiB
ru: КиБ

source: MiB
ru: МиБ

source: GiB
ru: ГиБ

source: TiB
ru: ТиБ

source: _Don't ask again
pt_pt: _Não perguntar novamente
ru: _Больше не спрашивать

source: Invalid filename
ru: Недопустимое имя файла

source: The file '{}' cannot be moved to '{}' because the destination name is invalid.
pt_pt: O ficheiro '{}' não pode ser movido para '{}' porque o nome de destino é inválido.
ru: Файл '{}' невозможно переместить в '{}': недопустимое имя места назначения.

source: File exists at destination
ru: Файл уже существует в месте назначения

source: The file '{}' cannot be moved to '{}' because the destination file exists.
pt_pt: O ficheiro '{}' não pode ser movido para '{}' porque o ficheiro de destino existe.
ru: Невозможно переместить файл '{}' в '{}', поскольку такой файл там уже существует.

source: _Rename
ru: _Переименовать

source: _Overwrite
ru: _Заменить

source: Error: invalid filename.
pt_pt: Erro: nome de ficheiro inválido.
ru: Ошибка: недопустимое имя файла.

source: New name:
pt_pt: Novo nome:
ru: Новое имя:

source: _Details
pt_pt: _Detalhes
ru: _Подробности

source: Couldn't create '{}' because its name is invalid.
pt_pt: Foi impossível criar '{}' porque o nome é inválido.
ru: Не удалось создать '{}': недопустимое имя.

source: The following items couldn't be created because their names are invalid:
pt_pt: Os seguintes itens não puderam ser criados porque os seus nomes são inválidos:
ru: Невозможно создать следующие объекты, так как их имена недопустимы:

source: _Pause
pt_pt: _Pausar
ru: _Пауза

source: _Automatically close when finished
pt_pt: Fechar _automaticamente quando terminar
ru: _Автоматически закрыть при завершении

source: _Continue
pt_pt: _Continuar
ru: Про_должить

source: The selected file no longer exists.
ru: Выбранный файл более не существует

source: Parent Directory
ru: Родительский каталог

source: _Match case
ru: _Учитывать регистр

source: Perform a case-insensitive search
ru: Осуществлять поиск с учётом регистра символов

source: Match _whole name only
ru: _Только имя целиком

source: Include _Directories
ru: В_ключая каталоги

source: Include _files
ru: Включая _файлы

source: _Regular expression
ru: _Регулярное выражение

source: Python regular expressions (like Perl's)
ru: Регулярное выражение Python (подобно Perl)

source: More options
ru: Дополнительные настройки

source: Hide extra options
ru: Скрыть дополнительные настройки

source: too many files in the filesystem
ru: слишком много файлов в файловой системе

source: too long a filename
ru: слишком длинное имя файла

source: couldn't read from and write to the disk image
pt_pt: foi impossível ler e escrever a imagem de disco
ru: не удаётся выполнить чтение и запись образа диска

source: couldn't extract to a temporary file ({})
pt_pt: foi impossível extrair para um ficheiro temporário ({})
ru: не удалось извлечь во временный файл ({})

source: either couldn't read from '{}' or couldn't write to the disk image
pt_pt: foi impossível ou ler de '{}' ou escrever para a imagem de disco
ru: ошибка или чтения из '{}', или записи в образ диска

source: the disk is too large to fit in 1459978240 bytes
ru: диск слишком большой, чтобы уместиться в 1459978240 байт

source: Name
pt_pt: Nome
ru: Имя

source: Create directory
pt_pt: Cria uma directoria
ru: Создать каталог

source: Paste cut or copied files
pt_pt: Cola ficheiros cortados ou colados
ru: Вставить вырезанные или скопированные файлы

source: Select all files
pt_pt: Selecciona todos os ficheiros
ru: Выделить все файлы

source: Go to parent directory
pt_pt: Sobe para a directoria acima
ru: Перейти в родительский каталог

source: Go to the previous directory
pt_pt: Vai para a directoria anterior
ru: Перейти в предыдущий каталог

source: Go to the next directory in history
pt_pt: Vai para a próxima directoria no histórico
ru: Перейти в следующий каталог в истории

source: Open all selected files
pt_pt: Abre todos os ficheiros seleccionados
ru: Открыть все выделенные файлы

source: Prepare to move selected files
pt_pt: Prepara para mover os ficheiros seleccionados
ru: Подготовить к перемещению выделенные файлы

source: Prepare to copy selected files
pt_pt: Prepara para copiar os ficheiros seleccionados
ru: Подготовить к копированию выделенные файлы

source: Delete selected files
pt_pt: Apaga os ficheiros seleccionados
ru: Удалить выделенные файлы

source: Rename selected files
pt_pt: Muda o nome aos ficheiros seleccionados
ru: Переименовать выделенные файлы

source: Close this file and load a different one
ru: Закрыть этот файл и загрузить другой

source: Go back to the list of recently opened files
ru: Вернуться к списку недавно открытых файлов

source: Quit the application
pt_pt: Sai da aplicação
ru: Выйти из приложения

source: Undo the last change
pt_pt: Anular a última alteração
ru: Отменить последнее изменение

source: _Import Files
pt_pt: _Importar Ficheiros
ru: _Импортировать файлы

source: Import files from outside
pt_pt: Importa ficheiros externos
ru: Импортировать внешние файлы

source: I_mport Directories
pt_pt: I_mportar Directorias
ru: И_мпортировать каталоги

source: Import directories from outside
pt_pt: Importa directorias externas
ru: Импортировать внешние каталоги

source: _Extract
pt_pt: _Extrair
ru: И_звлечь

source: Extract the selected files
pt_pt: Extrai os ficheiros seleccionados
ru: Извлечь выделенные файлы

source: Search for files in the disk
ru: Поиск файлов на диске

source: Open the preferences window
pt_pt: Abre a janela de preferências
ru: Открыть окно настроек

source: _Disk
ru: _Диск

source: _Discard Changes
ru: _Отменить изменения

source: Undo all changes that have been made since the last write
ru: Отменить все изменения, сделанные с момента последней записи

source: _Compress Disk
ru: С_жать диск

source: Reorganise files in the disk to reduce free space
ru: Реорганизовать файлы на диске для уменьшения занятого пространства

source: Decom_press Disk
ru: _Разжать диск

source: _Write
pt_pt: _Guardar
ru: _Записать

source: Write changes to the disk image
pt_pt: Guarda alterações feitas à imagem do disco
ru: Записать изменения в образ диска

source: _View
ru: _Вид

source: Size
ru: Размер

source: Close this file and open another?
ru: Закрыть этот файл и открыть другой?

source: The changes you've made will be lost if you open a different file.
ru: Сделанные изменения будут потеряны при открытии другого файла.

source: _Open Anyway
ru: Всё равно _открыть

source: Cancelling...
pt_pt: A cancelar...
ru: Отмена…

source: Preparing...
pt_pt: A preparar...
ru: Подготовка…

source: Completed {} of {} at {}/s; {}s remaining
ru: Завершено {} из {} при {}/с; {}с осталось

source: Completed {} of {}
pt_pt: {} de {} completos
ru: Завершено {} из {}

source: Force _Cancel
ru: _Отменить принудительно

source: Cannot cancel: files have been overwritten.
pt_pt: Impossível cancelar: ficheiros foram substituídos.
ru: Невозможно отменить: файлы были перезаписаны.

source: Force this operation to cancel?
ru: Принудительно отменить это действие?

source: Continue _Working
ru: П_родолжить работу

source: _Cancel Anyway
ru: _Отменить

source: Cancelled.
pt_pt: Cancelado.
ru: Отменено.

source: Completed
pt_pt: Completo
ru: Завершено

source: All items complete.
pt_pt: Todos os itens completos.
ru: Все объекты завершены.

source: No files selected: to extract, select some files first.
pt_pt: Nenhum ficheiro seleccionado: para extrair, seleccione alguns ficheiros primeiro.
ru: Файлы не выбраны: выберите файлы для извлечения.

source: Choose Where to Extract to
ru: Выберите, куда извлекать

source: Choose a Directory to Extract All Items to
ru: Выберите каталог для извлечения всех объектов

source: Couldn't extract: {}.
ru: Не удалось извлечь: {}.

source: reading or writing failed
ru: ошибка чтения или записи

source: Extracting Files
ru: Извлечение файлов

source: Extracting file: {}
pt_pt: A extrair o ficheiro: {}
ru: Извлечение файла: {}

source: Couldn't extract to the following locations. Maybe the files already exist, or you don't have permission to write here.
pt_pt: Foi impossível extrair para os seguintes locais. Talvez os ficheiros já existam, ou talvez não tenha permissão para escrever aqui.
ru: Не удалось извлечь в следующие места. Возможно, файлы уже существуют или у вас нет права на запись туда.

source: This will discard all changes that haven't been written to the disk.
ru: Это отменит ещё не записанные на диск изменения.

source: Moving file: {}
ru: Перемещение файла: {}

source: _Compress Anyway
ru: Всё равно _сжать

source: Compress this disk?
ru: Сжать этот диск?

source: Compressing Disk
ru: Сжатие диска

source: Couldn't compress: {}.
ru: Не удалось сжать: {}.

source: _Decompress Anyway
ru: Всё равно _разжать

source: Decompress this disk?
ru: Разжать этот диск?

source: Decompressing Disk
ru: Разжатие диска

source: Couldn't decompress: {}.
ru: Не удалось разжать: {}.

source: _Write Anyway
pt_pt: _Escrever na mesma
ru: Всё равно _записать

source: The disk has been changed by another program; write anyway?
ru: Диск был изменён другой программой. Всё равно записать?

source: Writing your changes now may corrupt some files in the disk.
ru: Запись изменений может повредить некоторые файлы на диске.

source: Write changes to the disk?
ru: Записать изменения на диск?

source: Once your changes have been written to the disk, they cannot be undone.
ru: После записи изменений на диск их будет уже невозможно отменить.

source: Couldn't write: {}.
pt_pt: Foi impossível escrever: {}.
ru: Не удалось записать: {}.

source: Writing to Disk
ru: Запись на диск

source: Copying file: {}
pt_pt: A copiar ficheiro: {}
ru: Копирование файла: {}

source: About {}
ru: О {}

source: Copyright 2012 Joseph Lansdowne
ru: Авторские права: Joseph Lansdowne, 2012

source: A GameCube disk editor
ru: Редактор дисков GameCube

source: translator-credits
ru: Launchpad Contributions: Aleksey Kabanov https://launchpad.net/~ak099

source: Are you sure you want to quit?
ru: Вы действительно хотите выйти?

source: If you don't write the changes you've made to the disk first, they will be lost.
ru: Если не записать сделанные изменения на диск, они будут потеряны.

source: _Quit Anyway
pt_pt: _Sair na mesma
ru: Всё равно _выйти

source: Choose Directories
ru: Выберите каталоги

source: Choose Files
ru: Выберите файлы

source: Can't import to a non-existent directory.
pt_pt: É impossível importar para uma directoria inexistente.
ru: Невозможно импортировать в несуществующий каталог.

source: Directory doesn't exist.
pt_pt: Directoria inexistente.
ru: Каталог не существует.

source: Drag-and-drop between instances is not supported yet.
pt_pt: Ainda não é possível arrastar-e-largar entre instâncias.
ru: Перетаскивание между экземплярами ещё не поддерживается.

source: Can't copy to a non-existent directory.
pt_pt: É impossível copiar para uma directoria inexistente.
ru: Невозможно копировать в несуществующий каталог.

source: Couldn't copy some items:
pt_pt: Foi impossível copiar alguns itens:
ru: Не удалось скопировать некоторые элементы:

source: Can't create a directory in a non-existent directory.
pt_pt: É impossível criar uma directoria numa directoria inexistente.
ru: Нельзя создать каталог в несуществующем каталоге.

source: Directory '{}' already exists.
pt_pt: A directoria '{}' já existe.
ru: Каталог '{}' уже существует.

source: Invalid file: {}
ru: Неверный файл: {}

source: Couldn't read the file: {}
ru: Не удалось выполнить чтение файла: {}

source: Open Disk Image
ru: Открыть образ диска

source: Recent files:
ru: Недавние файлы:

source: Path
ru: Путь

source: Remove _All
ru: Удалить _все

source: _Browse...
ru: О_бзор…

source: _Remove Anyway
ru: Всё равно _удалить

source: Remove the selected file from this list?
ru: Удалить выбранный файл из списка?

source: Remove all files from this list?
ru: Удалить все файлы из списка?

source: Automatically close _progress dialogues when finished
pt_pt: Fechar diálogos de _progresso automaticamente quando terminar
ru: _Автоматически закрывать диалог прогресса при завершении

source: _Enable trash
pt_pt: Ligar _caixote do lixo
ru: _Использовать корзину

source: Trash _location:
pt_pt: _Local do caixote:
ru: _Расположение корзины:

source: Maximum _size:
pt_pt: _Tamanho máximo:
ru: _Максимальный размер:

source: Set a specific directory to use for _temporary files
pt_pt: Indica uma directoria específica para os ficheiros t_emporários
ru: Ука_зать каталог для временных файлов

source: Otherwise the location is decided automatically
pt_pt: Caso contrário, a directoria é escolhida automaticamente
ru: Иначе местоположение будет выбрано автоматически

source: _Directory to use:
pt_pt: _Directoria a usar:
ru: _Каталог:

source: Read and write in _blocks of:
pt_pt: Ler e escrever em _blocos de:
ru: Чтение и запись _блоками по:

source: Limit search history
ru: Лимит истории поиска

source: Note that this only limits the number of searches saved to disk: the number of searches remembered for current session is always unlimited
ru: Ограничивает лишь количество поисков, сохранённых на диск: количество поисков, запомненных для текущего сеанса всегда неограниченно

source: Maximum number of saved searches:
ru: Максимальное число сохранённых поисков:

source: Choose a directory
pt_pt: Escolha uma directoria
ru: Выберите каталог

source: _Interface
ru: _Интерфейс

source: _Advanced
pt_pt: A_vançadas
ru: _Дополнительно

source: Preferences
pt_pt: Preferências
ru: Настройки

source: Choose files
pt_pt: Escolha os ficheiros

source: Redo the next change
pt_pt: Refazer a próxima alteração

source: Something may have gone horribly wrong, and the disk image might have ended up in an inconsistent state. Here's some debug information.
pt_pt: Algo pode ter corrido horrivelmente mal, e a imagem do disco pode estar num estado inconcistente. Aqui estão alguns dados de depuração.

source: Choose where to extract to
pt_pt: Escolha o local para onde extrair

source: Choose a directory to extract all items to
pt_pt: Escolha uma directoria para onde extrair todos os items

source: Extracting files
pt_pt: A extrair ficheiros

source: The contents of the disk have been changed by another program since it was loaded. Are you sure you want to continue?
pt_pt: Os conteúdos do disco foram alterados por outro programa desde que foi aberto. Tem a certeza que deseja continuar?

source: Confirm Write
pt_pt: Confirmar escrita

source: Once your changes have been written to the disk, they cannot be undone. Are you sure you want to continue?
pt_pt: Assim que as alterações forem escritas no disco, não poderão ser anuladas. Tem a certeza que deseja continuar?

source: Writing to disk
pt_pt: A escrever no disco

source: The changes you've made will be lost if you quit. Are you sure you want to continue?
pt_pt: As alterações que fez serão perdidas se sair. Tem a certeza que deseja continuar?

source: Confirm Quit
pt_pt: Confirmar saída

source: Open disk image
pt_pt: Abrir imagem de disco

source: root
pt_pt: raiz

source: '{}' is not a valid file
pt_pt: '{}' não é um ficheiro válido

source: _Drag to select files
pt_pt: _Arrastar para seleccionar ficheiros

source: Otherwise dragging moves or copies files, even if they are not already selected
pt_pt: Caso contrário, arrastar move ou copia ficheiros, mesmo que já não estejam seleccionados

source: _Re-enable all warnings
pt_pt: _Re-activar todos os avisos

source: It must be possible to encode file and directory names using the shift-JIS encoding, and '/' and null bytes ('\0') are not allowed.
pt_pt: Deve ser possível codificar os nomes dos ficheiros e das directorias usando o método shift-JIS, e '/' e os bytes nulos ('\0') não são permitidos.
